Repository: maabou512/ospo_paper2021
Catalog: LFResearch_OSPO_Report Folder/omegaT_Rainbow/pack1/pack1-level2.tmx
Source language: en_us
Languages: ja_jp

source: While open source software (OSS) arose organically with rapid bottoms-up adoption by developers, enterprises consuming open source realized over time that they needed to create governance structures and “guardrails” to ensure compliant use of this nascent and paradigm-shifting technology.
ja_jp: オープンソース ソフトウェア（OSS）は、開発者たちによる急速なボトムアップ的採用とともに有機的に発生しました。その一方でオープンソースを利用する企業は、この、発生したてで、パラダイムシフトを引き起こす技術を正しく利用するには、ガバナンスの構造や「ガードレール」を作る必要がある、ということに次第に気づくようになりました。

source: While open source usage did undergo legal review, each product group had their own compliance process and coordination.
ja_jp: オープンソースの使用は法務レビューを受けるものでしたが、各製品グループが独自のコンプライアンス プロセスと調整手段を持っていました。

source: While the percentage of responses from organizations with OSPO programs fell across all organization sizes, the decline was least pronounced in larger organizations.
ja_jp: OSPO プログラムを有している組織からの回答率は、すべての組織規模にわたり低下が見られましたが、大きな組織においてはその低下が小さいものとなりました。

source: With a detailed SBOM, technology leadership such as a chief technology officer (CTO) or chief information officer (CIO) can identify and closely monitor the most business-critical uses and preserve organizational security.
ja_jp: 詳細に書かれた SBOM によって、最高技術責任者（CTO）や最高情報責任者（CIO）などのテクノロジーリーダーは、最もビジネス クリティカルな使い方や組織上のセキュリティを認識し、これをしっかり監視します。

source: With these initiatives, an organization can grow its use of OSS and amplify its message that OSS is not only important but desirable and preferable to proprietary software products.
ja_jp: これらのイニシアチブによって、組織は OSS の使用を広げることができ、「OSS は重要なだけでなく、プロプライエタリなソフトウェア製品よりも望ましく、好ましいものだ」というわかりやすいメッセージを出すこともできてきます。

source: With this evolution has come greater reliance on OSS and the development of metrics to measure the impact of OPSOs on organizations, the impact of each organization on open source projects, and the general health of projects created and underwritten by the OSPO and its parent organization.
ja_jp: こういった進化に伴いさらに OSS におけるニーズが高まり、そして、(1)OSPO が組織に与える影響、(2)各組織がオープンソースプロジェクトに与える影響、(3)プロジェクトの全体的な健全性、を測るためのメトリックの開発 ― OSPO やその上位組織によって作られ費用面も含め支持されている活動 ― についても必要性が大きくなってきました。

source: With this inventory, the legal team—usually working with the OSPO team—can continuously monitor OSS usage and flag legal, security, or other project risks.
ja_jp: このインベントリを用い、法務チーム ― 通常は OSPO チームと連携します ― は、OSS の使用状況を継続的にモニタリングし、法的リスク、セキュリティリスク、その他のプロジェクトリスクにフラグを立てることができるようになります。

source: With this limited sample size, we cannot properly observe archetypes for smaller organizations, noncorporate entities, and organizations headquartered in other areas.
ja_jp: こういった限られたサンプル規模では、小規模な組織、非企業体、および他地域を本拠地としている組織に対する原型（典型的な特徴）を捉えることができません。

source: Wright and Fleming plan to extend
ja_jp: Write と Fleming は

source: Wright told us:
ja_jp: Wright はこう言います。

source: You don’t want people to think you are just monetizing open source without contributing back to the community,” said Chris Xie, head of the OSPO at Futurewei Technologies.
ja_jp: あそこはコミュニティへの還元をせず、オープンソースをマネタイズしようとしていると人々から思われたくはないですよね。」と、 Futurewei Technologies の OSPO の長である Chris Xie は言います。

source: [OSS] always comes with a license.
ja_jp: OSS には必ずライセンスがついてきます。

source: “2021 Open Source Security and Risk Analysis Report,” Synopsis Inc., May 14, 2021, p.
ja_jp: 「2021 Open Source Security and Risk Analysis Report」、Synopsis Inc.、2021年5月14日、

source: “As an organization, we are in between being a contributor but still more being a participant.
ja_jp: 「組織として見ると、私たちは中途半端なところにいて、コントリビューターというよりもまだまだ参加者（Participant）なのだと思います。

source: “At the beginning, when the knowledge of open source practices weren’t well distributed around the company, the bulk of the work we did was tactical—let’s get a specific thing done,” said Fleming.
ja_jp: 「当初、オープンソースのプラクティスに関する知識が社内で十分に浸透してなかったとき、私たちがした仕事の大部分は戦術的なもので、具体的なことに取り組むものでした」と Fleming は言います。

source: “Bloomberg had been very insular and protective of everything.
ja_jp: 「Bloomberg はあらゆることについてとても閉鎖的で、保護主義的でした。

source: “Companies usually start out with a lot of confusion.
ja_jp: 「企業はたいてい混乱のもとでスタートします。

source: “From business model to ecosystem building to determining what we can build and who we can collaborate with, I believe, OSPOs have a lot to offer.”
ja_jp: 「ビジネスモデルに 始まりエコシステムに至るまで、何を構築できるか、誰とコラボレーションできるかの決定に至るまで、OSPO にはできるオファーがたくさんあると思っています。」

source: “If someone brings a potential project to launch, we call in one of our internal subject matter experts to look over the code,” Fleming explained.
ja_jp: 「もし誰かがポテンシャルの高いプロジェクトを立ち上げようとしているときには、社内の専門家たちに声をかけコードを調査してもらいます。」Fleming はこう説明します。

source: “If they can find something that solves 90% of the problem and we can build expertise to deliver the remaining 10%, we will do that.
ja_jp: 「抱えている問題の90%を解決する何かを彼らが見つけ、残りの10%の解決手段を提供する専門知識を私たちが構築することができるのならば、私たちはそうするでしょう。

source: “If we are going to release a project, the engineers must obtain a commitment from their managers that they will have sufficient time to support the project,” he said.
ja_jp: 「私たちがプロジェクトをリリースする場合には、エンジニアたちはマネージャたちからそのプロジェクトをサポートする十分な時間があるという確約を得なければなりません。」と、彼は言います。

source: “It has evolved tremendously from joining mailing lists and Slacks to driving new open source initiatives.”
ja_jp: 「驚くべき進化です。当初メーリングリストやSlackへ参加するぐらいのところから、新たなオープンソース イニシアチブの立ち上げ推進までするようになりました。」

source: “It was clear that staying only with license compliance would not be enough.
ja_jp: 「ライセンスコンプライアンスだけに留まっていては不十分であることは明らかでした。

source: “Many developers who are not educated in open source think that because they are not purchasing software, there is no license involved because they didn’t sign a contract,” said Suzanne Ambiel, director of open source marketing and strategy at VMware.
ja_jp: 「オープンソースの教育を受けていない開発者たちの多くは、自分たちはソフトウェアを購入しているわけではなく、また契約書に署名するわけでもないので、ライセンス自体が存在していないと考えます。」とVMware のオープンソース マーケティング&ストラテジー担当ディレクターの Suzanne Ambiel は言います。

source: “One of the first things we looked at when we established the OSPO was the process for contributions,” said Michael Picht, chief architect of the OSPO at SAP.
ja_jp: 「OSPO が立ち上がった際、最初に注目したことの1つがコントリビューションのプロセスでした。」と、SAP で OSPO のチーフ アーキテクトを務める Michael Picht は言います。

source: “Open source software may be free—as in priceless—it can also be costly if used in a noncompliant way.
ja_jp: 「オープンソースソフトウェアはたぶん無料の意味での『フリー』なのでしょう。それを正しく使わなければコストがかかってしまうのに。

source: “Our VW Group (CARIAD) goal is to move from 10-20% in-house embedded software to at least 60% over 5 years.
ja_jp: 「私たち VW グループ（CARIAD）の目標は、インハウスの組込ソフトウエアの比率10-20%のところを5年間で60%以上に高めることです。

source: “Our developers can voluntarily associate their company ID with their GitHub login, which allows us to measure participation at a company level.” For the most part, the systematic collection and analysis of metrics occurs in the later stages of adoption, when OSS becomes a key element of the technology road map and strategy for enterprises and larger organizations, concurrent with the growth of OSPO programs, budgets, and staffs.
ja_jp: 「当社の開発者たちは、自分の意志で自社企業 ID を GitHub ログインに関連付けることができるため、企業レベルでの参加の計測ができます。」 たいていは、こういったメトリックのシステマチックな収集や分析は、後の段階 ― OSS が大手企業や大きな組織・機関の技術ロードマップや企業戦略の重要要素となり、並行して OSPO のプログラムや、予算、人材面での成長が進んだ段階 ― で行われます。

source: “So we had to learn how to be members of the open source community and straddle the boundaries of proprietary code and open source.”
ja_jp: 「なので、オープンソースコミュニティのメンバーとなり、プロプライエタリコードとオープンソースの境界線をまたぐやり方を学ばなくてはいけませんでした。」

source: “That inventory guided us to where we should be spending our resources for collaboration and contributions,” says Ruff.
ja_jp: 「このインベントリが、コラボレーションやコントリビューションのためにどこでリソースを費やすべきなのか、ということをガイドしてくれました。」と Ruff は言います。

source: “The company wanted to make sure that we had a single place which would drive open source engagement and compliance across the organization.
ja_jp: 「当社は、組織全体でオープンソースへのエンゲージメントとコンプライアンスを推進する単一の部門を持ちたいと考えていました。

source: “They might say, ‘The code looks old; no one writes Python that way anymore,’ and that’s a consideration because we do not want to be perceived in the community as pursuing dated practices or releasing lesser code.” Teams looking to release code must also commit to fostering community and responding to bugs and pull requests.
ja_jp: 「専門家である彼らが『このコードは古い、今はもうPythonでそんな書き方はしないよ』とでも言ったとしたらそれは考えものです。なぜなら私たちのプラクティスが時代遅れのものを追求しているとか、劣ったコードをリリースしているとか、そんな風に思われたくないからです。」コードをリリースするチームであれば、コミュニティを育てていくことや、バグやプルリクエストに対応することにもコミットしなければなりません。

source: “Today, we rely on other companies and other development efforts, so much so that we plan our internal releases based on what those groups are doing,” says Peters.
ja_jp: 「今日、私たちは他の企業や開発活動にとても依存しているので、そういったグループが今何をしているのか、にもとづき内部リリースを計画します。」と、Peters は言います。

source: “Using Word, Excel, and email, the process was not automated at all.
ja_jp: 「Word、Excel、メールを使いながらも、プロセスはまったく自動化されていなかったのです。

source: “We also needed to enhance our developer relations practice, to grow our community engagement with the leading foundations and ecosystems.”
ja_jp: 「また、開発者との関係を強化し、主要な財団やエコシステムといったコミュニティ エンゲージメントを高めることも必要でした。」

source: “We always had a compliance program.
ja_jp: 「当社にはいつもコンプライアンス プログラムがありました。

source: “We are happy to sponsor or speak at an Apache Spark conference, but not one put on by a company that sells a service built on Spark with proprietary modules,” he said, to give an example.
ja_jp: 「Apache Spark カンファレンスでスポンサーになったり登壇したりするのはうれしいことです。一方こういったイベントは、Spark 上にプロプラのモジュールを組み込んだサービスを販売する企業が開催するものではありません。」と彼は一例を挙げます。

source: “We didn’t want to rely on product teams but rather on a central point of contact for technical, legal and other questions.”
ja_jp: 「製品ごとのチームに相談するのではなく、技術、リーガル、その他の質問に対して相談できる中心的なコンタクトポイントがあり、そこに頼る形が望まれていました。」

source: “We focus on making it easy for our developers to work with [OSS], and we encourage them to contribute back to the projects they depend on.
ja_jp: 「私たちは、当社の開発者たちが OSS を使って働くことが簡単にできることに注力していて、彼らが依存するようなプロジェクトに還元する形でコントリビュートすることを奨励しています。

source: “We get so many requests from our customers asking for help and guidance on how to participate in open source or how to contribute or collaborate with us on projects,” said Deborah Bryant, senior director of open source at Red Hat.
ja_jp: 「オープンソースへの参加方法や、プロジェクトへのコントリビューションやコラボレーションの仕方について、顧客から非常にたくさんの要望をもらいます。」と、言うのは Red Hat のオープンソース担当シニアディレクターの Deborah Bryant です。

source: “We have found that we have needed to spend more time on some central management and administration of our participation in software foundations to ensure that we were getting a return on our investment and to re-evaluate our participation on a regular cadence,” she said.
ja_jp: 「私たちは、ソフトウェアの財団への参加の集約的な管理・運営に、より多くの時間を費やす必要があることに気づきました。このことは、投資からリターンを得ることを確かにし、定期的に私たちの参加を再評価することにもつながります。」と彼女は言います。

source: “We take that strongly into account—more strongly than ever.” Companies in regulated sectors like telecommunications must also understand their national export laws and navigate political tensions to preserve the OSS community and steer clear of international entanglements. “We always want to make sure our contributions are truly open, benefiting the community, and benefitting the industry at large,” Xie explained.
ja_jp: 「私たちは、このことを強く ― これまで以上に強く ― 念頭に入れています。」 また、通信業界のような規制セクターに属する企業は、OSS コミュニティを維持し、国際的な混乱を回避するべく、自国の輸出法を理解し、政治的緊張をやり過ごさなければなりません。 「私たちのコントリビューションが本当にオープンで、コミュニティに恩恵をもたらし、業界にわたっても恩恵をもたらす、私たちはそういったことも確かなものにしたいと常に思っているのです。」と Xie は説明してくれました。

source: “When an infrastructure team is considering a replacement of a technology that powers an internal service offering, our very strong preference is to first try to find an OSS solution to solve that problem,” explained Fleming.
ja_jp: 「インフラチームが社内サービスを支えているテクノロジーの置き換えを検討しているとき、私たちが強く推奨するのは、最初にその問題を解決する OSS のソリューションを見つける、ということです。」と、Fleming は説明します。

source: “When things change, like license changes or unexpected end of life (EOL) of products, we advise teams on what to do and how to react,” says Ruff.
ja_jp: 「ライセンスの変更や製品の予期しないEOLなど、物事の変化の際何をすべきか、どう対応すべきか、チームにアドバイスします。」と、Ruff は言います。

source: “With those projects, we discovered that many other major companies also found these projects useful and were getting actively involved in the project.
ja_jp: 「こういったプロジェクトで、他の多くの大手企業もこういったプロジェクトが有益だと考え、積極的にプロジェクトに関与していることがわかったのです。

source: “You have to make sure that you give back just as much as you take in.
ja_jp: 「『取り入れたのと同じくらい還元する』、これを確かなものとするべきです。
